Uni-Libraries/Uni.HAL/src/rcc/uni_hal_rcc_stm32l4.c
//
// Includes
//

// stdlib
#include <stdint.h>

// ST
#include <stm32l4xx_ll_bus.h>
#include <stm32l4xx_ll_cortex.h>
#include <stm32l4xx_ll_rcc.h>
#include <stm32l4xx_ll_system.h>
#include <stm32l4xx_ll_utils.h>

// Uni.Common
#include <uni_common.h>

// UNI_HAL
#include "core/uni_hal_core.h"
#include "gpio/uni_hal_gpio.h"
#include "pwr/uni_hal_pwr_stm32.h"
#include "rcc/uni_hal_rcc.h"
#include "rcc/uni_hal_rcc_stm32l4.h"
#include "systick/uni_hal_systick.h"


//
// Globals
//

uni_hal_rcc_stm32l4_config_t *g_uni_hal_rcc_config = NULL;
uni_hal_rcc_stm32l4_status_t g_uni_hal_rcc_status = {0};

UNI_COMMON_COMPILER_WEAK uint32_t SystemCoreClock = 4'000'000U;

UNI_COMMON_COMPILER_WEAK const uint8_t AHBPrescTable[16] = {
    0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 1U, 2U, 3U, 4U, 6U, 7U, 8U, 9U
};
UNI_COMMON_COMPILER_WEAK const uint8_t APBPrescTable[8] = {0U, 0U, 0U, 0U, 1U, 2U, 3U, 4U};
UNI_COMMON_COMPILER_WEAK const uint32_t MSIRangeTable[12] = {
    100000U, 200000U, 400000U, 800000U, 1000000U, 2000000U,
    4000000U, 8000000U, 16000000U, 24000000U, 32000000U, 48000000U
};


//
// Private
//

static uint32_t _uni_hal_rcc_pll_get_m(uint32_t val)
{
    uint32_t result  = LL_RCC_PLLM_DIV_1;
    switch (val)
    {
    case 1:
        result = LL_RCC_PLLM_DIV_1;
        break;
    case 2:
        result = LL_RCC_PLLM_DIV_2;
        break;
    case 3:
        result = LL_RCC_PLLM_DIV_3;
        break;
    case 4:
        result = LL_RCC_PLLM_DIV_4;
        break;
    case 5:
        result = LL_RCC_PLLM_DIV_5;
        break;
    case 6:
        result = LL_RCC_PLLM_DIV_6;
        break;
    case 7:
        result = LL_RCC_PLLM_DIV_7;
        break;
    case 8:
        result = LL_RCC_PLLM_DIV_8;
        break;
    default:
        break;
    }
    return result;
}


static uint32_t _uni_hal_rcc_pll_get_n(uint32_t val)
{
    uint32_t result  = 8;
    if (val >= 8 && val <= 127)
    {
        result = val;
    }
    return result;
}


static uint32_t _uni_hal_rcc_pll_get_r(uint32_t val)
{
    uint32_t result  = LL_RCC_PLLR_DIV_2;
    switch (val)
    {
    case 2:
        result = LL_RCC_PLLR_DIV_2;
        break;
    case 4:
        result = LL_RCC_PLLR_DIV_4;
        break;
    case 6:
        result = LL_RCC_PLLR_DIV_6;
        break;
    case 8:
        result = LL_RCC_PLLR_DIV_8;
        break;
    default:
        break;
    }
    return result;
}


/**
 * Get HCLK frequency
 * @return HCLK frequency in hertz
 */
static uint32_t _uni_hal_rcc_get_hclk_freq(void) {
    // get HCLK freq
    LL_RCC_ClocksTypeDef clocks;
    LL_RCC_GetSystemClocksFreq(&clocks);
    return clocks.HCLK_Frequency;
}


static uint32_t _uni_hal_rcc_get_pclk1_freq(void) {
    // get HCLK freq
    LL_RCC_ClocksTypeDef clocks;
    LL_RCC_GetSystemClocksFreq(&clocks);
    return clocks.PCLK1_Frequency;
}

static uint32_t _uni_hal_rcc_get_pclk2_freq(void) {
    // get HCLK freq
    LL_RCC_ClocksTypeDef clocks;
    LL_RCC_GetSystemClocksFreq(&clocks);
    return clocks.PCLK2_Frequency;
}

/**
 * Configure FLASH latency
 * TODO: move out
 */
static void _uni_hal_stm_rcc_flash(void) {
    LL_FLASH_SetLatency(LL_FLASH_LATENCY_4);
    while (LL_FLASH_GetLatency() != LL_FLASH_LATENCY_4) {
    }
}


/**
 * Configure high speed external clock
 * @param ctx RCC context
 * @return true on success
 */
static bool _uni_hal_stm_rcc_hse() {
    bool result = false;

    if (g_uni_hal_rcc_config->hse_bypass)
    {
        LL_RCC_HSE_EnableBypass();
    }

    // Enable HSE
    LL_RCC_HSE_Enable();

    // Wait till HSE is ready
    uint32_t ticks = uni_hal_systick_get_ms();
    while (!LL_RCC_HSE_IsReady() && (uni_hal_systick_get_ms() - ticks) < g_uni_hal_rcc_config->timeout.hse) {
    }

    // save HSE status
    result = g_uni_hal_rcc_status.hse_inited = LL_RCC_HSE_IsReady();

    // enable HSE
    if (result && g_uni_hal_rcc_config->hse_css) {
        LL_RCC_HSE_EnableCSS();
    }

    return result;
}

/**
 * Configure high speed internal clock
 * @param ctx RCC context
 * @return true on success
 */
static bool _uni_hal_stm_rcc_hsi() {
    bool result = false;

    LL_RCC_HSI_Enable();

    /* Wait till HSI is ready */
    uint32_t ticks = uni_hal_systick_get_ms();
    while (!LL_RCC_HSI_IsReady() && (uni_hal_systick_get_ms() - ticks) < g_uni_hal_rcc_config->timeout.hsi) {
    }

    result = g_uni_hal_rcc_status.hsi_inited = LL_RCC_HSI_IsReady();

    if (result) {
        LL_RCC_HSI_SetCalibTrimming(64);
    }

    return result;
}

/**
 * Initialize SysTick
 * @return true on success
 */
static bool _uni_hal_rcc_systick() {
    // setup SysTick
    NVIC_SetPriority(SysTick_IRQn, 0U);
    LL_InitTick(_uni_hal_rcc_get_hclk_freq(), 1000U);
    LL_SYSTICK_EnableIT();

    return true;
}

/**
 * Configure low speed external clockAHBPrescTable
 * @param ctx RCC context
 * @return true on success
 */
static bool _uni_hal_stm_rcc_lse() {
    bool result = false;

    // Check LSE_IsReady flag
    result = g_uni_hal_rcc_status.lse_inited = LL_RCC_LSE_IsReady();

    if (!result) {
        uni_hal_pwr_stm_set_backup_access(true);
        LL_RCC_LSE_SetDriveCapability(LL_RCC_LSEDRIVE_MEDIUMLOW);
        LL_RCC_LSE_Enable();

        /* Wait till LSE is ready */
        uint32_t ticks = uni_hal_systick_get_ms();
        while (!LL_RCC_LSE_IsReady() && (uni_hal_systick_get_ms() - ticks) < g_uni_hal_rcc_config->timeout.lse) {
        }
        uni_hal_pwr_stm_set_backup_access(false);

        // Check LSE_IsReady flag
        result = g_uni_hal_rcc_status.lse_inited = LL_RCC_LSE_IsReady();

        // Try one time to reset Backup Domain and init LSE again
        if (!result && !g_uni_hal_rcc_status.lse_backup_reseted) {
            uni_hal_rcc_reset(UNI_HAL_RCC_RESET_BACKUP);
            g_uni_hal_rcc_status.lse_backup_reseted = true;
            result = _uni_hal_stm_rcc_lse();
        }
    }


    return result;
}

/**
 * Configure low speed internal clock
 * @param ctx RCC context
 * @return true on success
 */
static bool _uni_hal_stm_rcc_lsi() {
    bool result = false;

    LL_RCC_LSI_Enable();

    // Wait till LSE is ready
    uint32_t ticks = uni_hal_systick_get_ms();
    while (!LL_RCC_LSI_IsReady() && (uni_hal_systick_get_ms() - ticks) < g_uni_hal_rcc_config->timeout.lsi) {
    }

    result = g_uni_hal_rcc_status.lsi_inited = LL_RCC_LSI_IsReady();


    return result;
}

/**
 * Configure phase locked loops
 * @param ctx RCC context
 * @return true on success
 */
static bool _uni_hal_stm_rcc_pll() {
    bool result = false;

    uint32_t clock_source = LL_RCC_PLLSOURCE_NONE;
    uint32_t pll_division = 1;

    if (g_uni_hal_rcc_status.hse_inited) {
        clock_source = LL_RCC_PLLSOURCE_HSE;
        pll_division = 1;
    } else if (g_uni_hal_rcc_status.hsi_inited) {
        clock_source = LL_RCC_PLLSOURCE_HSI;
        pll_division = HSI_VALUE / HSE_VALUE;
    }

    if (clock_source != LL_RCC_PLLSOURCE_NONE) {
        //PPL1
        LL_RCC_PLL_ConfigDomain_SYS(clock_source,
            _uni_hal_rcc_pll_get_m(g_uni_hal_rcc_config->pll[0].m * pll_division),
            _uni_hal_rcc_pll_get_n(g_uni_hal_rcc_config->pll[0].n),
            _uni_hal_rcc_pll_get_r(g_uni_hal_rcc_config->pll[0].r));
        LL_RCC_PLL_EnableDomain_SYS();

