Uni-Libraries/Uni.HAL/src/rcc/uni_hal_rcc_stm32l4.c
        LL_RCC_PLL_Enable();

        /* Wait till PLL is ready */
        uint32_t ticks = uni_hal_systick_get_ms();
        while (!LL_RCC_PLL_IsReady() && (uni_hal_systick_get_ms() - ticks) < g_uni_hal_rcc_config->timeout.pll) {
        }

        result = g_uni_hal_rcc_status.pll_inited = LL_RCC_PLL_IsReady();
    }

    return result;
}

/**
 * Configure device system clock
 * @param ctx RCC context
 * @return true on success
 */
static bool _uni_hal_stm_rcc_sysclk() {
    bool result = false;

    uint32_t clock_source = 0;
    uint32_t clock_source_status = 0;

    if (g_uni_hal_rcc_status.pll_inited) {
        clock_source = LL_RCC_SYS_CLKSOURCE_PLL;
        clock_source_status = LL_RCC_SYS_CLKSOURCE_STATUS_PLL;
    } else if (g_uni_hal_rcc_status.hse_inited) {
        clock_source = LL_RCC_SYS_CLKSOURCE_HSE;
        clock_source_status = LL_RCC_SYS_CLKSOURCE_STATUS_HSE;
    } else if (g_uni_hal_rcc_status.hsi_inited) {
        clock_source = LL_RCC_SYS_CLKSOURCE_HSI;
        clock_source_status = LL_RCC_SYS_CLKSOURCE_STATUS_HSI;
    }

    // Reconfigure sysclk
    LL_RCC_SetSysClkSource(clock_source);

    /* Wait till System clock is ready */
    uint32_t ticks = uni_hal_systick_get_ms();
    while (LL_RCC_GetSysClkSource() != clock_source_status && (uni_hal_systick_get_ms() - ticks) <
            g_uni_hal_rcc_config->timeout.pll) {
    }

    result = LL_RCC_GetSysClkSource() == clock_source_status;
    g_uni_hal_rcc_status.sys_inited = result;

    if (result) {
        // Set prescalers
        LL_RCC_SetAHBPrescaler(LL_RCC_SYSCLK_DIV_1);
        LL_RCC_SetAPB1Prescaler(LL_RCC_APB1_DIV_1);
        LL_RCC_SetAPB2Prescaler(LL_RCC_APB2_DIV_1);

        // Update sysclk value
        SystemCoreClockUpdate();

        // Reconfigure systick
        _uni_hal_rcc_systick();
    }

    return result;
}

/**
 * Configure peripherals
 * @param ctx RCC context
 */
static void _uni_hal_stm_rcc_peripherials() {
    LL_RCC_SetADCClockSource(LL_RCC_ADC_CLKSOURCE_SYSCLK);

    LL_RCC_SetI2CClockSource(LL_RCC_I2C1_CLKSOURCE_PCLK1);
    LL_RCC_SetI2CClockSource(LL_RCC_I2C2_CLKSOURCE_PCLK1);
    LL_RCC_SetI2CClockSource(LL_RCC_I2C3_CLKSOURCE_PCLK1);
    LL_RCC_SetI2CClockSource(LL_RCC_I2C4_CLKSOURCE_PCLK1);

    if (g_uni_hal_rcc_status.pll_inited) {
        LL_RCC_SetRNGClockSource(LL_RCC_RNG_CLKSOURCE_PLL);
    } else {
        LL_RCC_SetRNGClockSource(LL_RCC_RNG_CLKSOURCE_HSI48);
    }

    LL_RCC_SetUARTClockSource(LL_RCC_UART4_CLKSOURCE_PCLK1);

    LL_RCC_SetUSARTClockSource(LL_RCC_USART1_CLKSOURCE_PCLK2);
    LL_RCC_SetUSARTClockSource(LL_RCC_USART2_CLKSOURCE_PCLK1);
}

static bool _uni_hal_rcc_update_status_reg() {
    bool result = false;
    //TODO g_uni_hal_rcc_status.rcc_csr_reg = (uint8_t) ((RCC->CSR) >> 24);
    LL_RCC_ClearResetFlags();
    result = true;

    return result;
}

static uint32_t _uni_hal_rcc_apb1_prescaler_get(){
    uint32_t result = 1;

    switch(LL_RCC_GetAPB1Prescaler()){
        case LL_RCC_APB1_DIV_1:
            result = 1;
            break;
        case LL_RCC_APB1_DIV_2:
            result = 2;
            break;
        case LL_RCC_APB1_DIV_4:
            result = 4;
            break;
        case LL_RCC_APB1_DIV_8:
            result = 8;
            break;
        case LL_RCC_APB1_DIV_16:
            result = 16;
            break;
    }

    return result;
}

static uint32_t _uni_hal_rcc_apb2_prescaler_get(){
    uint32_t result = 1;

    switch(LL_RCC_GetAPB2Prescaler()){
        case LL_RCC_APB2_DIV_1:
            result = 1;
            break;
        case LL_RCC_APB2_DIV_2:
            result = 2;
            break;
        case LL_RCC_APB2_DIV_4:
            result = 4;
            break;
        case LL_RCC_APB2_DIV_8:
            result = 8;
            break;
        case LL_RCC_APB2_DIV_16:
            result = 16;
            break;
    }

    return result;
}


//
// Public
//

bool uni_hal_rcc_init() {
    bool result = false;

    // enable configuration clocking
    uni_hal_rcc_clk_set(UNI_HAL_CORE_PERIPH_SYSCFG, true);
    uni_hal_rcc_clk_set(UNI_HAL_CORE_PERIPH_PWR, true);

    // set flash latency
    _uni_hal_stm_rcc_flash();

    // initialize systick
    _uni_hal_rcc_systick();

    // basic settings
    _uni_hal_rcc_update_status_reg();
    // TODO: move to another file

    // HSE
    if (g_uni_hal_rcc_config->hse_enable)
    {
        _uni_hal_stm_rcc_hse();
    }

    // HSI
    _uni_hal_stm_rcc_hsi();

    // LSE/LSI
    _uni_hal_stm_rcc_lse();
    g_uni_hal_rcc_status.lse_inited = false; //TODO: remove
    if (!g_uni_hal_rcc_status.lse_inited) {
        _uni_hal_stm_rcc_lsi();
    }

    // PLL
    _uni_hal_stm_rcc_pll();

    // SYSCLK
    _uni_hal_stm_rcc_sysclk();

    // PERIPHERIALS
    _uni_hal_stm_rcc_peripherials();

    result = true;
    g_uni_hal_rcc_status.inited = true;

    return result;
}


bool uni_hal_rcc_is_inited() {
    return g_uni_hal_rcc_status.inited;
}

uint8_t uni_hal_rcc_get_status_reg() {
    uint8_t result = 0;
    if (uni_hal_rcc_is_inited()) {
        result = 0; //TODO: g_uni_hal_rcc_status.rcc_csr_reg;
    }
    return result;
}


bool uni_hal_rcc_get_status_reg_flag(uint8_t flag) {
    bool result = false;
    if (uni_hal_rcc_is_inited()) {
        result = flag != 0; //TODO g_uni_hal_rcc_status.rcc_csr_reg & flag;
    }
    return result;
}


bool uni_hal_rcc_reset(uni_hal_rcc_reset_target_e target) {
    bool result = false;

    switch (target) {
        case UNI_HAL_RCC_RESET_BACKUP:
            uni_hal_pwr_stm_set_backup_access(true);
        LL_RCC_ForceBackupDomainReset();
        LL_RCC_ReleaseBackupDomainReset();
        uni_hal_pwr_stm_set_backup_access(false);
        g_uni_hal_rcc_status.lse_backup_reseted = true;
        result = true;
        break;
        default:
            break;
    }

    return result;
}


//
// Clock
//

bool uni_hal_rcc_clk_get(uni_hal_core_periph_e clock) {
    bool result = false;

    switch (clock) {
        case UNI_HAL_CORE_PERIPH_ADC_1:
        case UNI_HAL_CORE_PERIPH_ADC_2:
        case UNI_HAL_CORE_PERIPH_ADC_3:
            result = LL_AHB2_GRP1_IsEnabledClock(LL_AHB2_GRP1_PERIPH_ADC);
            break;
        case UNI_HAL_CORE_PERIPH_CAN_1:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_CAN1);
            break;
        case UNI_HAL_CORE_PERIPH_CAN_2:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_CAN2);
            break;
        case UNI_HAL_CORE_PERIPH_CRC_1:
            result = LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_CRC);
            break;
        case UNI_HAL_CORE_PERIPH_DAC_1:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_DAC1);
            break;
        case UNI_HAL_CORE_PERIPH_DMA_1:
            result = LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_DMA1);
            break;
        case UNI_HAL_CORE_PERIPH_DMA_2:
            result = LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_DMA2);
            break;
        case UNI_HAL_CORE_PERIPH_GPIO_A:
            result = LL_AHB2_GRP1_IsEnabledClock(LL_AHB2_GRP1_PERIPH_GPIOA);
            break;
        case UNI_HAL_CORE_PERIPH_GPIO_B:
            result = LL_AHB2_GRP1_IsEnabledClock(LL_AHB2_GRP1_PERIPH_GPIOB);
            break;
        case UNI_HAL_CORE_PERIPH_GPIO_C:
            result = LL_AHB2_GRP1_IsEnabledClock(LL_AHB2_GRP1_PERIPH_GPIOC);
            break;
        case UNI_HAL_CORE_PERIPH_GPIO_D:
            result = LL_AHB2_GRP1_IsEnabledClock(LL_AHB2_GRP1_PERIPH_GPIOD);
            break;
        case UNI_HAL_CORE_PERIPH_GPIO_E:
            result = LL_AHB2_GRP1_IsEnabledClock(LL_AHB2_GRP1_PERIPH_GPIOE);
            break;
        case UNI_HAL_CORE_PERIPH_GPIO_F:
            result = LL_AHB2_GRP1_IsEnabledClock(LL_AHB2_GRP1_PERIPH_GPIOF);
            break;
        case UNI_HAL_CORE_PERIPH_GPIO_G:
            result = LL_AHB2_GRP1_IsEnabledClock(LL_AHB2_GRP1_PERIPH_GPIOG);
            break;
        case UNI_HAL_CORE_PERIPH_GPIO_H:
            result = LL_AHB2_GRP1_IsEnabledClock(LL_AHB2_GRP1_PERIPH_GPIOH);
            break;
        case UNI_HAL_CORE_PERIPH_GPIO_I:
            result = LL_AHB2_GRP1_IsEnabledClock(LL_AHB2_GRP1_PERIPH_GPIOI);
            break;
        case UNI_HAL_CORE_PERIPH_I2C_1:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_I2C1);
            break;
        case UNI_HAL_CORE_PERIPH_I2C_2:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_I2C2);
            break;
        case UNI_HAL_CORE_PERIPH_I2C_3:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_I2C3);
            break;
        case UNI_HAL_CORE_PERIPH_I2C_4:
            result = LL_APB1_GRP2_IsEnabledClock(LL_APB1_GRP2_PERIPH_I2C4);
            break;
        case UNI_HAL_CORE_PERIPH_LPUART_1:
            result = LL_APB1_GRP2_IsEnabledClock(LL_APB1_GRP2_PERIPH_LPUART1);
            break;
        case UNI_HAL_CORE_PERIPH_PWR:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_PWR);
            break;
        case UNI_HAL_CORE_PERIPH_RNG:
            result = LL_AHB2_GRP1_IsEnabledClock(LL_AHB2_GRP1_PERIPH_RNG);
            break;
        case UNI_HAL_CORE_PERIPH_RTC:
            result = LL_RCC_IsEnabledRTC();
            break;
        case UNI_HAL_CORE_PERIPH_SPI_1:
            result = LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_SPI1);
            break;
        case UNI_HAL_CORE_PERIPH_SPI_2:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_SPI2);
            break;
        case UNI_HAL_CORE_PERIPH_SPI_3:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_SPI3);
            break;
        case UNI_HAL_CORE_PERIPH_SYSCFG:
            result = LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_SYSCFG);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_1:
            result = LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_TIM1);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_2:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_TIM2);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_3:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_TIM3);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_4:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_TIM4);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_5:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_TIM5);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_6:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_TIM6);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_7:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_TIM7);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_8:
            result = LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_TIM8);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_15:
            result = LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_TIM15);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_16:
            result = LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_TIM16);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_17:
            result = LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_TIM17);
            break;
        case UNI_HAL_CORE_PERIPH_UART_1:
            result = LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_USART1);
            break;
        case UNI_HAL_CORE_PERIPH_UART_2:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_USART2);
            break;
        case UNI_HAL_CORE_PERIPH_UART_3:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_USART3);
            break;
        case UNI_HAL_CORE_PERIPH_UART_4:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_UART4);
            break;
        case UNI_HAL_CORE_PERIPH_UART_5:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_UART5);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_9:
        case UNI_HAL_CORE_PERIPH_TIM_10:
        case UNI_HAL_CORE_PERIPH_TIM_11:
        case UNI_HAL_CORE_PERIPH_TIM_12:
        case UNI_HAL_CORE_PERIPH_TIM_13:
        case UNI_HAL_CORE_PERIPH_TIM_14:
        default:
            break;
    }

    return result;
}


bool uni_hal_rcc_clk_set(uni_hal_core_periph_e target, bool state) {
    bool result = false;

