Uni-Libraries/Uni.HAL/src/rcc/uni_hal_rcc_stm32l4.c
    if (state != uni_hal_rcc_clk_get(target)) {
        result = false;
        switch (target) {
            case UNI_HAL_CORE_PERIPH_ADC_1:
            case UNI_HAL_CORE_PERIPH_ADC_2:
            case UNI_HAL_CORE_PERIPH_ADC_3:
                state
                    ? LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_ADC)
                    : LL_AHB2_GRP1_DisableClock(LL_AHB2_GRP1_PERIPH_ADC);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_CAN_1:
                state
                    ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_CAN1)
                    : LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_CAN1);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_CAN_2:
                if (state) {
                    //CAN1 must be also enabled to bring CAN2 into the working state
                    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_CAN1);
                    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_CAN2);
                } else {
                    LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_CAN2);
                }
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_CRC_1:
                state
                    ? LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_CRC)
                    : LL_AHB1_GRP1_DisableClock(LL_AHB1_GRP1_PERIPH_CRC);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_DAC_1:
                state
                    ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_DAC1)
                    : LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_DAC1);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_DMA_1:
                state
                    ? LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMA1)
                    : LL_AHB1_GRP1_DisableClock(LL_AHB1_GRP1_PERIPH_DMA1);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_DMA_2:
                state
                    ? LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMA2)
                    : LL_AHB1_GRP1_DisableClock(LL_AHB1_GRP1_PERIPH_DMA2);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_GPIO_A:
                state
                    ? LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOA)
                    : LL_AHB2_GRP1_DisableClock(LL_AHB2_GRP1_PERIPH_GPIOA);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_GPIO_B:
                state
                    ? LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOB)
                    : LL_AHB2_GRP1_DisableClock(LL_AHB2_GRP1_PERIPH_GPIOB);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_GPIO_C:
                state
                    ? LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOC)
                    : LL_AHB2_GRP1_DisableClock(LL_AHB2_GRP1_PERIPH_GPIOC);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_GPIO_D:
                state
                    ? LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOD)
                    : LL_AHB2_GRP1_DisableClock(LL_AHB2_GRP1_PERIPH_GPIOD);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_GPIO_E:
                state
                    ? LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOE)
                    : LL_AHB2_GRP1_DisableClock(LL_AHB2_GRP1_PERIPH_GPIOE);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_GPIO_F:
                state
                    ? LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOF)
                    : LL_AHB2_GRP1_DisableClock(LL_AHB2_GRP1_PERIPH_GPIOF);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_GPIO_G:
                state
                    ? LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOG)
                    : LL_AHB2_GRP1_DisableClock(LL_AHB2_GRP1_PERIPH_GPIOG);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_GPIO_H:
                state
                    ? LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOH)
                    : LL_AHB2_GRP1_DisableClock(LL_AHB2_GRP1_PERIPH_GPIOH);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_GPIO_I:
                state
                    ? LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOI)
                    : LL_AHB2_GRP1_DisableClock(LL_AHB2_GRP1_PERIPH_GPIOI);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_I2C_1:
                state
                    ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C1)
                    : LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_I2C1);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_I2C_2:
                state
                    ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C2)
                    : LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_I2C2);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_I2C_3:
                state
                    ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C3)
                    : LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_I2C3);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_I2C_4:
                state
                    ? LL_APB1_GRP2_EnableClock(LL_APB1_GRP2_PERIPH_I2C4)
                    : LL_APB1_GRP2_DisableClock(LL_APB1_GRP2_PERIPH_I2C4);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_LPUART_1:
            state
                ? LL_APB1_GRP2_EnableClock(LL_APB1_GRP2_PERIPH_LPUART1)
                : LL_APB1_GRP2_DisableClock(LL_APB1_GRP2_PERIPH_LPUART1);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_PWR:
                state
                    ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_PWR)
                    : LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_PWR);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_RNG:
                state
                    ? LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_RNG)
                    : LL_AHB2_GRP1_DisableClock(LL_AHB2_GRP1_PERIPH_RNG);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_RTC:
                uni_hal_pwr_stm_set_backup_access(true);
            state ? LL_RCC_EnableRTC() : LL_RCC_DisableRTC();
            uni_hal_pwr_stm_set_backup_access(false);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_SPI_1:
                state
                    ? LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SPI1)
                    : LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_SPI1);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_SPI_2:
                state
                    ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_SPI2)
                    : LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_SPI2);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_SPI_3:
                state
                    ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_SPI3)
                    : LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_SPI3);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_SYSCFG:
                state
                    ? LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SYSCFG)
                    : LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_SYSCFG);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_TIM_1:
                state
                    ? LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM1)
                    : LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_TIM1);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_TIM_2:
                state
                    ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM2)
                    : LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_TIM2);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_TIM_3:
                state
                    ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM3)
                    : LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_TIM3);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_TIM_4:
                state
                    ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM4)
                    : LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_TIM4);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_TIM_5:
                state
                    ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM5)
                    : LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_TIM5);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_TIM_6:
                state
                    ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM6)
                    : LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_TIM6);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_TIM_7:
                state
                    ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM7)
                    : LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_TIM7);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_TIM_8:
                state
                    ? LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM8)
                    : LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_TIM8);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_TIM_15:
                state
                    ? LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM15)
                    : LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_TIM15);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_TIM_16:
                state
                    ? LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM16)
                    : LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_TIM16);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_TIM_17:
                state
                    ? LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM17)
                    : LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_TIM17);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_UART_1:
                state
                    ? LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART1)
                    : LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_USART1);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_UART_2:
                state
                    ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART2)
                    : LL_APB2_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_USART2);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_UART_3:
                state
                    ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART3)
                    : LL_APB2_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_USART3);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_UART_4:
                state
                    ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_UART4)
                    : LL_APB2_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_UART4);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_UART_5:
                state
                    ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_UART5)
                    : LL_APB2_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_UART5);
            result = true;
            break;
            case UNI_HAL_CORE_PERIPH_TIM_9:
            case UNI_HAL_CORE_PERIPH_TIM_10:
            case UNI_HAL_CORE_PERIPH_TIM_11:
            case UNI_HAL_CORE_PERIPH_TIM_12:
            case UNI_HAL_CORE_PERIPH_TIM_13:
            case UNI_HAL_CORE_PERIPH_TIM_14:
            default:
                break;
        }
    }

