Uni-Libraries/Uni.HAL/src/rcc/uni_hal_rcc_stm32l4.c
    return  result;
}

uint32_t uni_hal_rcc_clk_get_freq(uni_hal_core_periph_e target) {
    uint32_t result = 0U;
    if (uni_hal_rcc_is_inited()) {
        switch (target) {
            case UNI_HAL_CORE_PERIPH_SYSCLK:
                result = _uni_hal_rcc_get_hclk_freq();
                break;
            case UNI_HAL_CORE_PERIPH_LPUART_1:
                result = LL_RCC_GetLPUARTClockFreq(LL_RCC_LPUART1_CLKSOURCE);
                break;
            case UNI_HAL_CORE_PERIPH_UART_1:
                result = LL_RCC_GetUSARTClockFreq(LL_RCC_USART1_CLKSOURCE);
                break;
            case UNI_HAL_CORE_PERIPH_UART_2:
                result = LL_RCC_GetUSARTClockFreq(LL_RCC_USART2_CLKSOURCE);
                break;
            case UNI_HAL_CORE_PERIPH_UART_3:
                result = LL_RCC_GetUSARTClockFreq(LL_RCC_USART3_CLKSOURCE);
                break;
            case UNI_HAL_CORE_PERIPH_UART_4:
                result = LL_RCC_GetUARTClockFreq(LL_RCC_UART4_CLKSOURCE);
                break;
            case UNI_HAL_CORE_PERIPH_UART_5:
                result = LL_RCC_GetUARTClockFreq(LL_RCC_UART5_CLKSOURCE);
                break;
            case UNI_HAL_CORE_PERIPH_TIM_1:
            case UNI_HAL_CORE_PERIPH_TIM_8:
            case UNI_HAL_CORE_PERIPH_TIM_15:
            case UNI_HAL_CORE_PERIPH_TIM_16:
            case UNI_HAL_CORE_PERIPH_TIM_17:
                result = _uni_hal_rcc_get_pclk2_freq() * ((_uni_hal_rcc_apb2_prescaler_get() > 1) ? 2 : 1);
                break;
            case UNI_HAL_CORE_PERIPH_TIM_2:
            case UNI_HAL_CORE_PERIPH_TIM_3:
            case UNI_HAL_CORE_PERIPH_TIM_4:
            case UNI_HAL_CORE_PERIPH_TIM_5:
            case UNI_HAL_CORE_PERIPH_TIM_6:
            case UNI_HAL_CORE_PERIPH_TIM_7:
                result = _uni_hal_rcc_get_pclk1_freq() * ((_uni_hal_rcc_apb1_prescaler_get() > 1) ? 2 : 1);
                break;
            case UNI_HAL_CORE_PERIPH_TIM_9:
            case UNI_HAL_CORE_PERIPH_TIM_10:
            case UNI_HAL_CORE_PERIPH_TIM_11:
            case UNI_HAL_CORE_PERIPH_TIM_12:
            case UNI_HAL_CORE_PERIPH_TIM_13:
            case UNI_HAL_CORE_PERIPH_TIM_14:
                result = 0;
                break;
            default:
                break;
        }
    }

    return result;
}


//
// Clock Source
//

uni_hal_rcc_clksrc_e uni_hal_rcc_clksrc_get(uni_hal_core_periph_e target) {
    uni_hal_rcc_clksrc_e result = UNI_HAL_RCC_CLKSRC_UNKNOWN;
    if (uni_hal_rcc_is_inited()) {
        switch (target) {
            case UNI_HAL_CORE_PERIPH_RTC:
                uni_hal_pwr_stm_set_backup_access(true);
                switch (LL_RCC_GetRTCClockSource()) {
                    case LL_RCC_RTC_CLKSOURCE_NONE:
                        result = UNI_HAL_RCC_CLKSRC_NONE;
                        break;
                    case LL_RCC_RTC_CLKSOURCE_LSE:
                        result = UNI_HAL_RCC_CLKSRC_LSE;
                        break;
                    case LL_RCC_RTC_CLKSOURCE_LSI:
                        result = UNI_HAL_RCC_CLKSRC_LSI;
                        break;
                    case LL_RCC_RTC_CLKSOURCE_HSE_DIV32:
                        result = UNI_HAL_RCC_CLKSRC_HSE_DIV_32;
                        break;
                    default:
                        break;
                }
                uni_hal_pwr_stm_set_backup_access(false);
                break;
            default:
                break;
        }
    }
    return result;
}


bool uni_hal_rcc_clksrc_set(uni_hal_core_periph_e target, uni_hal_rcc_clksrc_e source) {
    bool result = false;

    if (uni_hal_rcc_is_inited()) {
        switch (target) {
            case UNI_HAL_CORE_PERIPH_LPUART_1: {
                    uint32_t src = LL_RCC_LPUART1_CLKSOURCE_SYSCLK;
                    if (source == UNI_HAL_RCC_CLKSRC_PCLK1) {
                        src = LL_RCC_LPUART1_CLKSOURCE_PCLK1;
                    } else if (source == UNI_HAL_RCC_CLKSRC_SYSCLK) {
                        src = LL_RCC_LPUART1_CLKSOURCE_SYSCLK;
                    } else if (source == UNI_HAL_RCC_CLKSRC_HSI) {
                        src = LL_RCC_LPUART1_CLKSOURCE_HSI;
                    } else if (source == UNI_HAL_RCC_CLKSRC_LSE){
                        src = LL_RCC_LPUART1_CLKSOURCE_LSE;
                    }
                    LL_RCC_SetLPUARTClockSource(src);
                    result = true;
                    break;
            }
            case UNI_HAL_CORE_PERIPH_RTC: {
                uint32_t src = LL_RCC_RTC_CLKSOURCE_NONE;
                if (source == UNI_HAL_RCC_CLKSRC_LSE) {
                    src = LL_RCC_RTC_CLKSOURCE_LSE;
                } else if (source == UNI_HAL_RCC_CLKSRC_LSI) {
                    src = LL_RCC_RTC_CLKSOURCE_LSI;
                } else if (source == UNI_HAL_RCC_CLKSRC_HSE_DIV_32) {
                    src = LL_RCC_RTC_CLKSOURCE_HSE_DIV32;
                } else {
                    src = LL_RCC_RTC_CLKSOURCE_NONE;
                }

                uni_hal_pwr_stm_set_backup_access(true);
                LL_RCC_SetRTCClockSource(src);
                uni_hal_pwr_stm_set_backup_access(false);
                result = true;
                break;
            }
            default:
                break;
        }
    }

    return result;
}

bool uni_hal_rcc_stm32l4_config_set(uni_hal_rcc_stm32l4_config_t* config)
{
    bool result = false;
    if (config != NULL) {
        g_uni_hal_rcc_config = config;
        result = true;
    }
    return result;
}


uint32_t uni_hal_rcc_stm32_mco_enable(uint32_t mco_index, uni_hal_rcc_clksrc_e clock_source, uint32_t clock_divider) {
    bool result = false;
    if (mco_index == 0 && (clock_divider == 1 || clock_divider == 2 || clock_divider == 4 || clock_divider == 8 || clock_divider == 16)) {
        // configure pin
        uni_hal_gpio_pin_context_t pin = {
                .gpio_bank = UNI_HAL_CORE_PERIPH_GPIO_A,
                .gpio_pin = UNI_HAL_GPIO_PIN_8,
                .gpio_speed = UNI_HAL_GPIO_SPEED_3,
                .gpio_type = UNI_HAL_GPIO_TYPE_ALTERNATE_PP,
                .alternate = UNI_HAL_GPIO_ALTERNATE_0,
        };
        result = uni_hal_gpio_pin_init(&pin);

        uint32_t source = UINT32_MAX;
        uint32_t prescaler = UINT32_MAX;
        switch (clock_source) {
            case UNI_HAL_RCC_CLKSRC_HSI:
                source = LL_RCC_MCO1SOURCE_HSI;
                break;
            case UNI_HAL_RCC_CLKSRC_LSE:
                source = LL_RCC_MCO1SOURCE_LSE;
                break;
            case UNI_HAL_RCC_CLKSRC_HSE:
                source = LL_RCC_MCO1SOURCE_HSE;
                break;
            case UNI_HAL_RCC_CLKSRC_PLL1R:
                source = LL_RCC_MCO1SOURCE_PLLCLK;
                break;
            case UNI_HAL_RCC_CLKSRC_HSI48:
                source = LL_RCC_MCO1SOURCE_HSI48;
                break;
            case UNI_HAL_RCC_CLKSRC_SYSCLK:
                source = LL_RCC_MCO1SOURCE_SYSCLK;
                break;
            case UNI_HAL_RCC_CLKSRC_MSI:
                source = LL_RCC_MCO1SOURCE_MSI;
                break;
            case UNI_HAL_RCC_CLKSRC_LSI:
                source = LL_RCC_MCO1SOURCE_LSI;
                break;
            default:
                break;
        }

        switch (clock_divider) {
            case 1:
                prescaler = LL_RCC_MCO1_DIV_1;
                break;
            case 2:
                prescaler = LL_RCC_MCO1_DIV_2;
                break;
            case 4:
                prescaler = LL_RCC_MCO1_DIV_4;
                break;
            case 8:
                prescaler = LL_RCC_MCO1_DIV_8;
                break;
            case 16:
                prescaler = LL_RCC_MCO1_DIV_16;
                break;
            default:
                break;
        }

        if (source != UINT32_MAX && prescaler != UINT32_MAX) {
            LL_RCC_ConfigMCO(source, prescaler);
            result = true;
        }
    }
    return result;
}


//
// STM32L4 - Interrupts
//

void NMI_Handler(void) {
    if (LL_RCC_IsActiveFlag_HSECSS()) {
        LL_RCC_ClearFlag_HSECSS();
        g_uni_hal_rcc_config->hse_enable = false;

        g_uni_hal_rcc_status.hse_inited = false;
        g_uni_hal_rcc_status.pll_inited = false;
        g_uni_hal_rcc_status.sys_inited = false;

        _uni_hal_stm_rcc_pll();
        _uni_hal_stm_rcc_sysclk();
    }
}
